Revit 2027 API
SymbolTypeId.Percent Property
 Symbol %, indicating unit Percentage.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Percent { get; }
Public Shared ReadOnly Property Percent As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Percent {
	ForgeTypeId^ get ();
}
static member Percent : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace